СРО_Копия/src/Reports/СРО_СводныйНФ/СРО_СводныйНФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СРО_СводныйНФ</name>
</mdclass:Report>

СРО_Копия/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииКПК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВРеестреСРО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВступленияВСРО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсключенияИзСРО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субъект</name>
    <type>
      <types>CatalogRef.СРО_Субъекты</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеГУ</name>
    <type>
      <types>CatalogRef.СРО_УправленияГУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидацияБанкротство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Район</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предписания</name>
    <attributes>
      <name>ДатаНачалаПредписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

СРО_Копия/src/Reports/СРО_СводныйНФ/Forms/ФормаОтчета/Module.bsl
&НаСервереБезКонтекста

Функция ПолучитьМассивПериодов(НачалоПериода, ОкончаниеПериода)
	
	МассивПериодов = Новый Массив;            	
	ВремПериод = КонецКвартала(НачалоПериода);    
	
	Пока ВремПериод <= ОкончаниеПериода Цикл
		МассивПериодов.Добавить(ВремПериод);  		
		ВремПериод = КонецКвартала(ДобавитьМесяц(ВремПериод, 3));
	КонецЦикла;
	
	Возврат МассивПериодов;
	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПараметров(ДокументОтчетности, МассивКодов)
	
	СтруктураЗначение = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка КАК Ссылка,
	|	ОтчетностьКПКТаблицаПоказателей.Раздел КАК Раздел,
	|	ОтчетностьКПКТаблицаПоказателей.Показатель1 КАК Показатель
	|ИЗ
	|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
	|ГДЕ
	|	ОтчетностьКПКТаблицаПоказателей.Ссылка = &ДокументОтчетности
	|	И ОтчетностьКПКТаблицаПоказателей.Раздел.Код В (&МассивКодов)";
	
	Запрос.УстановитьПараметр("ДокументОтчетности", ДокументОтчетности);
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл                                                                    		
		СтруктураЗначение.Вставить("Раздел" + СокрЛП(Выборка.Раздел.Код), Выборка.Показатель);	
	КонецЦикла;
	
	Возврат СтруктураЗначение;                                                                       
	
КонецФункции


&НаСервере
Функция СформироватьНаСервере() 	
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 	 
	
	ВремТаблицаДляРассылки = РеквизитФормыВЗначение("ТаблицаДляРассылки");
	
	НайденныеСтроки = ВремТаблицаДляРассылки.найтиСтроки(Новый Структура("Флаг", Истина));
	
	МассивКПК = Новый Массив;
	Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл   		
		МассивКПК.Добавить(НайденнаяСтрока.КПК);	
	КонецЦикла;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаНачалаОтчета", ПериодОтчета.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончанияОтчета", КонецДня(ПериодОтчета.ДатаОкончания));
	СтруктураПараметров.Вставить("МассивКПК", МассивКПК); 	                                       	
	СтруктураПараметров.Вставить("МассивСубъектов", ОтборПоСубъектам.ВыгрузитьЗначения()); 	
	СтруктураПараметров.Вставить("МассивУправленийГУ", ОтборПоУправлениямГУ.ВыгрузитьЗначения()); 	
	СтруктураПараметров.Вставить("ВидОтбораОтчета", ВидОтбораОтчета); 
	
	МассивТабДокументов = Отчеты.СРО_СводныйНФ.СформироватьТабличныеДокументы(СтруктураПараметров);	
	
	Возврат МассивТабДокументов[0];	

КонецФункции 


&НаКлиенте
Процедура Сформировать(Команда)  
	
	ТабличныйДокумент = СформироватьНаСервере();  
	ТабличныйДокумент.Показать("Сводный ФН"); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)      
	ОбновитьВидимостьРеквизитов();
КонецПроцедуры                    

&НаСервере
Функция ПолучитьКПКДокумента(ВыбДокумент)
	Если ТипЗнч(ВыбДокумент) = Тип("ДокументСсылка.ОтчетностьКПК") 
		ИЛИ ТипЗнч(ВыбДокумент) = Тип("ДокументОбъект.ОтчетностьКПК") Тогда
		Возврат ВыбДокумент.КПК;
	Иначе
		Возврат Неопределено;		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуОшибокНаСервере() 	
	
	ВремТЗ = Отчет.ТаблицаОшибок.Выгрузить();                                          				   
	
	ВремТЗ.Свернуть("КПК, НазваниеТаблицы, ОписаниеУсловия, НомерВРеестреСРО, КодОшибки", "КоличествоОшибок, ПорядокСортировки");
	
	ПорядокСортировки = 0;
	Для Каждого ТекСтрока ИЗ ВремТЗ Цикл
		
		ПорядокСортировки = ПорядокСортировки + 1;      		
		ТекСтрока.ПорядокСортировки = ПорядокСортировки;		
		
	КонецЦикла;

	Возврат ВремТЗ;	
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокКПК(Команда)
	
	ТаблицаДляРассылки.Очистить();
	
	ДопПараметры = Новый Структура;
	ОткрытьФорму("Отчет.СРО_СводныйНФ.Форма.ФормаОтбораПоСписку", ДопПараметры, ЭтаФорма);   

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу(МассивКПК)
	
	ВремТаблица = РеквизитФормыВЗначение("ТаблицаДляРассылки");
	
	Для Каждого ТекКПК ИЗ МассивКПК Цикл		
		НоваяСтрока = ВремТаблица.Добавить();		
		НоваяСтрока.КПК = ТекКПК;
		НоваяСтрока.НомерВРеестреСРО = СокрЛП(ТекКПК.НомерВРеестреСРО);
		НоваяСтрока.ИНН = СокрЛП(ТекКПК.ИНН);
		НоваяСтрока.ОГРН = СокрЛП(ТекКПК.ОГРН);
		НоваяСтрока.Флаг = Истина;		
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ВремТаблица, "ТаблицаДляРассылки");
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)	
	ЗаполнитьТаблицу(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеКПК(КПК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.ОГРН КАК ОГРН,
	|	Контрагенты.НомерВРеестреСРО КАК НомерВРеестреСРО
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &КПК";
	
	Запрос.УстановитьПараметр("КПК", КПК);
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДанныхКПК = Новый Структура("ИНН, ОГРН, НомерВРеестреСРО");
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураДанныхКПК;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтруктураДанныхКПК, Выборка);
	
	Возврат СтруктураДанныхКПК;
	
КонецФункции
	
&НаКлиенте
Процедура ТаблицаДляРассылкиКПКПриИзменении(Элемент)
	
	СтруктураДанныхКПК =ПолучитьДанныеКПК(Элементы.ТаблицаДляРассылки.ТекущиеДанные.КПК);
 
	Элементы.ТаблицаДляРассылки.ТекущиеДанные.ИНН = СтруктураДанныхКПК.ИНН;
	Элементы.ТаблицаДляРассылки.ТекущиеДанные.ОГРН = СтруктураДанныхКПК.ОГРН;
	Элементы.ТаблицаДляРассылки.ТекущиеДанные.НомерВРеестреСРО = СтруктураДанныхКПК.НомерВРеестреСРО;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьРеквизитов()    		
	Элементы.ОтборПоСубъектам.Видимость = ВидОтбораОтчета = 1;
	Элементы.ОтборПоУправлениямГУ.Видимость = ВидОтбораОтчета = 2;
	Элементы.ТаблицаДляРассылки.Видимость = ВидОтбораОтчета = 0; 	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтбораОтчетаПриИзменении(Элемент)
	ОбновитьВидимостьРеквизитов();		
КонецПроцедуры
